<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introduction</a></span></li><li><span><a href="#Installation" data-toc-modified-id="Installation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Installation</a></span></li><li><span><a href="#Introduction-to-pandas-data-structures" data-toc-modified-id="Introduction-to-pandas-data-structures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introduction to pandas data structures</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Dataframes" data-toc-modified-id="Dataframes-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Dataframes</a></span><ul class="toc-item"><li><span><a href="#From-data-types" data-toc-modified-id="From-data-types-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>From data types</a></span></li><li><span><a href="#From-path" data-toc-modified-id="From-path-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span>From path</a></span></li><li><span><a href="#From-databases" data-toc-modified-id="From-databases-3.2.3"><span class="toc-item-num">3.2.3&nbsp;&nbsp;</span>From databases</a></span></li></ul></li></ul></li><li><span><a href="#Exploratory-analysis-of-a-dataframe" data-toc-modified-id="Exploratory-analysis-of-a-dataframe-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Exploratory analysis of a dataframe</a></span><ul class="toc-item"><li><span><a href="#Meta-information" data-toc-modified-id="Meta-information-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Meta information</a></span></li><li><span><a href="#Previsualization" data-toc-modified-id="Previsualization-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Previsualization</a></span></li><li><span><a href="#Order-a-dataframe" data-toc-modified-id="Order-a-dataframe-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Order a dataframe</a></span></li><li><span><a href="#NaN-values" data-toc-modified-id="NaN-values-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>NaN values</a></span></li><li><span><a href="#Basic-descriptive-statistics" data-toc-modified-id="Basic-descriptive-statistics-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Basic descriptive statistics</a></span></li></ul></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

#Â Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

## Introduction
Pandas is undoubtedly the most widely used library in the Python ecosystem for data manipulation and analysis. It's fast, powerful, flexible, easy to use and open source.


Among its main features:

- A fast and efficient **DataFrame** object for data manipulation with built-in indexing* 

- **Reading and writing** of data in many formats: Microsoft Excel, CSV, SQL databases, etc;

- Integrated and efficient methods for all types of data manipulation: missing data, subset, union, merge, etc;

- Ease of working with temporary data (in fact, Pandas is named after "PANnel DAta")

- Good **integration with other data analysis or Machine learning libraries**: scikit-learn, scipy, seaborn, plotly, etc;

- It is **widely used** in both the private and academic sectors


Pandas provides high-level data structures and functions designed to make working with structured or tabular data fast, easy, and expressive. Since its introduction in 2010, it has helped make Python a powerful and productive data analysis environment. The main pandas objects that will be used in this book are the DataFrame, a column-oriented tabular data structure with row and column labels, and the Series, a labeled one-dimensional array object.

Pandas combines the high performance ideas of NumPy with the flexible data manipulation capabilities of spreadsheets and relational databases (such as SQL). It provides sophisticated indexing functionality to make it easy to reshape, slice and dice, perform aggregations, and select subsets of data.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Source: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

## Installation

The first thing you should do will always be
`pip install pandas`, `conda install pandas`

In [1]:
#Â anaconda
    # enviroments: ironhack
    #pandas
    
#Â miniconda
    #Â conda activate ironhack
    # pip install pandas

In [1]:
import pandas as pd
import numpy as np

## Introduction to pandas data structures
To get started with pandas, you'll need to get comfortable with its two working data structures: Series and DataFrame. Although they are not a universal solution to all problems, they provide a solid and easy-to-use foundation for most applications.

### Series
A Serie is a one-dimensional array object containing a sequence of values â€‹â€‹(of NumPy-like types) and an associated array of data labels, called its index. The simplest Series is formed from a single array of data:

In [2]:
my_series = pd.Series([2, 3, "una string", 9.0])

In [8]:
my_series

0             2
1             3
2    una string
3             9
dtype: object

In [7]:
[2, 3, "una string", 9.0]

[2, 3, 'una string', 9.0]

In [9]:
type(my_series)

pandas.core.series.Series

In [15]:
my_series.values

array([2, 3, 'una string', 9.0], dtype=object)

In [16]:
my_series.index

RangeIndex(start=0, stop=4, step=1)

The string representation of a Series displayed interactively shows the index on the left and the values â€‹â€‹on the right. Since we didn't specify an index for the data, a default one consisting of the integers 0 to N - 1 (where N is the length of the data) is created. You can get the array representation and the index object of the Series through its values â€‹â€‹and index attributes, respectively:

Another way to think of a Series is as a fixed-length ordered dict, since it is a mapping of index values â€‹â€‹to data values. It can be used in many contexts where a dictionary could be used.
If you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [40]:
some_info = {
    "Ohio": 34567,
    "Texas": 2345,
    "Oregon":23456, 
    "Utah": 23456,
    "otra cosa": 234567
}

In [41]:
some_info

{'Ohio': 34567,
 'Texas': 2345,
 'Oregon': 23456,
 'Utah': 23456,
 'otra cosa': 234567}

In [42]:
some_info.values()

dict_values([34567, 2345, 23456, 23456, 234567])

In [43]:
some_info.keys()

dict_keys(['Ohio', 'Texas', 'Oregon', 'Utah', 'otra cosa'])

When only one dict is passed, the resulting String index will have the keys of the dict in order. You can override this by passing the keys of the dict in the order you want them to appear in the resulting String:

In [44]:
some_info_series = pd.Series(some_info)

In [46]:
display(some_info_series)

Ohio          34567
Texas          2345
Oregon        23456
Utah          23456
otra cosa    234567
dtype: int64

In [45]:
type(some_info_series)

pandas.core.series.Series

In [24]:
some_info_series.values

array([ 34567,   2345,  23456,  23456, 234567])

In [25]:
some_info_series.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah', 'otra cosa'], dtype='object')

In [26]:
some_info_series

Ohio          34567
Texas          2345
Oregon        23456
Utah          23456
otra cosa    234567
dtype: int64

In [27]:
states = ["California", "Ohio", "Texas", "Oregon", "Utah"]

In [28]:
some_info_series = pd.Series(some_info, index=states)

In [29]:
some_info_series

California        NaN
Ohio          34567.0
Texas          2345.0
Oregon        23456.0
Utah          23456.0
dtype: float64

In [32]:
for i in some_info_series.values:
    print(type(i))

<class 'numpy.float64'>
<class 'numpy.float64'>
<class 'numpy.float64'>
<class 'numpy.float64'>
<class 'numpy.float64'>

In [ ]:
#unsupported operand type(s) for +: 'float' and 'str' help me

In [ ]:
#Â quitar los Nan
#Â crear una funciÃ³n
    #Â try:
    #Â except:
#Â modificar los nan para que sea: "NaN"

In [ ]:
#empty value
#nan value
    #int
    #floats

Here, the three values â€‹â€‹found in sdata were placed in the appropriate places, but since no value was found for 'California', it appears as NaN (not a number), which is considered in pandas to mark missing values â€‹â€‹or NA. Since "Utah" was not included in the states, it is excluded from the resulting object.

### Dataframes
Pandas can read and write data from a wide variety of formats. [Read the documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Although one of the most common is from a dict of lists of equal length or NumPy arrays:

#### From data types

`from dictionaries with lists as values`

In [41]:
dictionary_with_lists = {
    "state":["California", "Utah"],
    "year":[1940, 23456],
    "something else": ["sdsd", "Random"]
}

In [42]:
df = pd.DataFrame(dictionary_with_lists)

In [43]:
type(df)

pandas.core.frame.DataFrame

In [44]:
df

        state   year something else
0  California   1940           sdsd
1        Utah  23456         Random

Since we are using Jupyter Notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table. [More info on this](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html)

`from list of dictionaries`

If I create a dataframe through a list of dictionaries:
- Each dictionary will be a row
- The keys will be the names of the columns
- They have to have the same structure

In [46]:
lista_dict_ = [
{"col1":["value col1", "value col 3"]}, #cada elemento de la lista: 
{"col2":["value col2", "value col 3"]},
{"col3":["value col3", "value col 3"]}]

In [56]:
lista_2_dict = [
    {"state": "california", "year": 870, "otracosa": "ðŸ¥°"}, #fila1
    {"state": "utah", "year": 870, "otracosa": "ðŸ¤¨"}, #fila2
    {"state": "nevada", "year": 870, "otracosa_":"ðŸ¥¸"}, #fila3
]

In [57]:
df = pd.DataFrame(lista_2_dict)
df

        state  year otracosa otracosa_
0  california   870        ðŸ¥°       NaN
1        utah   870        ðŸ¤¨       NaN
2      nevada   870      NaN         ðŸ¥¸

[pandas from dict](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.from_dict.html)

#### From path

`.csv`

In [58]:
df = pd.read_csv("../../datasets/Advertising.csv")
df

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

`.xlsx`, `xls`, `xlsm`, `xlsb`, `odf`, `ods`, `odt`

In [ ]:
df = pd.read_excel("../../datasets/Online Retail.xlsx", engine='openpyxl')
df.sample()

In [ ]:
#df = pd.read_csv("../../datasets/asets/airbnb_data.csv", sep=";")

`Reading different sheeets`

`web`: https://raw.githubusercontent.com/datapackage-examples/sample-csv/master/sample.csv

In [ ]:
pd.read_csv("https://raw.githubusercontent.com/Ironhack-data-bcn-feb-2023/lectures/main/datasets/Tweets.csv")

#### From databases

`sql`: [docs](https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html)

```python
from sqlite3 import connect

conn = connect(':memory:')
df = pd.read_sql('SELECT column_1, column_2 FROM sample_data', conn)

df.to_sql('test_data', conn)
```

`mongodb`

```python
import pymongo
from pymongo import MongoClient

client = MongoClient()
db = client.database_name
collection = db.collection_name
data = pd.DataFrame(list(collection.find()))
```

## Exploratory analysis of a dataframe

### Meta information

`shape, columns, dtypes, info, describe`

In [3]:
df = pd.read_csv("../../datasets/Advertising.csv")
df

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [4]:
df.shape

(200, 4)

In [7]:
df.columns

Index(['TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [6]:
for i in df.columns:
    print(i)

TV
Radio
Newspaper
Sales

In [ ]:
"""
class DataFrame(data):

    def__init__(self):
        self.shape = shape

    def info ():
        return 
    
"""
mi_df = DataFrame()
mi_df.shape

In [9]:
df.info();

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   Radio      200 non-null    float64
 2   Newspaper  200 non-null    float64
 3   Sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [10]:
df.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

[How dtypes work](https://numpy.org/doc/stable/reference/arrays.dtypes.html)

### Previsualization

`head`

In [16]:
df.head() #Return the first `n` rows.

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

By default head shows me the first 5 rows, I can see some more or less by passing a number as a parameter

In [ ]:
df.head(7)

`tail`

In [14]:
df.tail()

        TV  Radio  Newspaper  Sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

`df.sample()`

In [34]:
df.sample()

      TV  Radio  Newspaper  Sales
60  53.5    2.0       21.4    8.1

### Order a dataframe

In [2]:
df = pd.read_csv("../../datasets/avocado_kaggle.csv")
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
17715,6,2018-02-11,1.59,10754.39,535.84,3567.35,0.0,6651.2,5192.81,1458.39,0.0,organic,2018,CincinnatiDayton

Same operation, but give me only concrete columns

`sample`

`display`

In [47]:
#display(some_info)

In [48]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
1591,31,2015-05-24,1.04,512172.44,2624.76,372289.48,53.34,137204.86,137204.86,0.0,0.0,conventional,2015,NorthernNewEngland

In [53]:
#df.describe()

In [59]:
df.sort_values(by="AveragePrice", ascending=False)[["AveragePrice", "type"]] #AveragePrice, type

       AveragePrice          type
14125          3.25       organic
17428          3.17       organic
14124          3.12       organic
16055          3.05       organic
16720          3.04       organic
...             ...           ...
1716           0.49  conventional
15262          0.49       organic
15473          0.48       organic
7412           0.46  conventional
15261          0.44       organic

[18249 rows x 2 columns]

### NaN values
NaN stands for Not A Number and is one of the common ways to represent the missing value in the data. It is a special floating point value and cannot be converted to a type other than float.
The NaN value is one of the main problems in data analysis. It is very essential to deal with NaN to get the desired results.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   Date          18249 non-null  object
 2   AveragePrice  18249 non-null  float64
 3   Total Volume  18249 non-null  float64
 4   4046          18249 non-null  float64
 5   4225          18249 non-null  float64
 6   4770          18249 non-null  float64
 7   Total Bags    18249 non-null  float64
 8   Small Bags    18249 non-null  float64
 9   Large Bags    18249 non-null  float64
 10  XLarge Bags   18249 non-null  float64
 11  type          18249 non-null  object
 12  year          18249 non-null  int64
 13  region        18249 non-null  object
dtypes: float64(9), int64(2), object(3)
memory usage: 1.9+ MB

In [10]:
df.isna().sum()

Unnamed: 0      0
Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
year            0
region          0
dtype: int64

In [6]:
df.isnull().sum()

Unnamed: 0      0
Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
year            0
region          0
dtype: int64

###  Basic descriptive statistics

In [36]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
11194,40,2015-03-22,1.36,5490.76,68.95,4201.88,0.0,1219.93,233.33,986.6,0.0,organic,2015,Roanoke

In [13]:
df["AveragePrice"].max()

3.25

In [16]:
df.AveragePrice.max()

3.25

In [27]:
df.AveragePrice.min()

0.44

In [28]:
df.AveragePrice.mean()

1.4059784097758825

In [14]:
df["Average Price"].max()

KeyError: 'Average Price'

In [41]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
4907,19,2016-08-14,1.19,512843.34,154532.23,299818.16,14039.56,44453.39,44453.39,0.0,0.0,conventional,2016,Sacramento

In [38]:
df["type"].value_counts()

conventional    9126
organic         9123
Name: type, dtype: int64

In [39]:
df.type.value_counts()

conventional    9126
organic         9123
Name: type, dtype: int64

In [40]:
df["AveragePrice"].value_counts() #?

1.15    202
1.18    199
1.08    194
1.26    193
1.13    192
       ...
3.05      1
3.03      1
2.91      1
0.48      1
2.96      1
Name: AveragePrice, Length: 259, dtype: int64

In [48]:
df.region.value_counts()

BuffaloRochester       338
Sacramento             338
SouthCentral           338
Nashville              338
Pittsburgh             338
Charlotte              338
NorthernNewEngland     338
Southeast              338
West                   338
Orlando                338
Houston                338
Northeast              338
Roanoke                338
Philadelphia           338
CincinnatiDayton       338
SanDiego               338
Denver                 338
NewYork                338
Albany                 338
Chicago                338
Columbus               338
Syracuse               338
MiamiFtLauderdale      338
Plains                 338
Indianapolis           338
SouthCarolina          338
BaltimoreWashington    338
GreatLakes             338
California             338
LasVegas               338
HartfordSpringfield    338
NewOrleansMobile       338
Atlanta                338
Tampa                  338
SanFrancisco           338
StLouis                338
Louisville             338
HarrisburgScranton     338
GrandRapids            338
Portland               338
TotalUS                338
Boise                  338
Midsouth               338
Seattle                338
Detroit                338
LosAngeles             338
Jacksonville           338
RichmondNorfolk        338
RaleighGreensboro      338
Spokane                338
PhoenixTucson          338
DallasFtWorth          338
Boston                 338
WestTexNewMexico       335
Name: region, dtype: int64

In [47]:
df.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values â€‹â€‹of a column
df.col.unique() # returns unique values â€‹â€‹from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)